In [5]:
import pandas as pd
import numpy as np

###1D data -series, 2d data-dataframe structure

In [9]:
list1=["A","B","C","D","E"]
series1=pd.Series(list1,index=['a ','b','c','d','e'])
print(series1)

a     A
b     B
c     C
d     D
e     E
dtype: object

In [12]:
array=np.random.randint(20,25,10)
size=(10)

In [11]:
array

array([22, 21, 22, 21, 24, 24, 24, 21, 23, 20], dtype=int32)

In [14]:
series2=pd.Series(array)
series2

0    23
1    24
2    21
3    20
4    22
5    23
6    21
7    22
8    24
9    22
dtype: int32

In [17]:
series3=pd.Series(np.random.randint(30,35,size=(10) ))

In [18]:
series3

0    31
1    32
2    30
3    34
4    31
5    31
6    34
7    34
8    33
9    33
dtype: int32

In [20]:
print(series2+ series3)

0    54
1    56
2    51
3    54
4    53
5    54
6    55
7    56
8    57
9    55
dtype: int32

Dataframe

In [26]:
student=["Student1","Student2","Student3","Student4","Student5"]
Rollno=['001','002','003','004','005']
scores=[45,56,54,67,87]

record={
    "Students":student,
    "Roll No":Rollno,
    "Scores":scores,
}

In [27]:
record

{'Students': ['Student1', 'Student2', 'Student3', 'Student4', 'Student5'],
 'Roll No': ['001', '002', '003', '004', '005'],
 'Scores': [45, 56, 54, 67, 87]}

In [37]:
record_df=pd.DataFrame(record)
record_df.set_index('Roll No',inplace=True)

record_df

         Students  Scores
Roll No
001      Student1      45
002      Student2      56
003      Student3      54
004      Student4      67
005      Student5      87

In [38]:
dict1={
    "A":[12,13,45,56,78],
    "B":[13,16,18,14,19],
    "C":[45,34,23,15,17],
    "D":[45,34,23,23,32],
}
dict1

{'A': [12, 13, 45, 56, 78],
 'B': [13, 16, 18, 14, 19],
 'C': [45, 34, 23, 15, 17],
 'D': [45, 34, 23, 23, 32]}

In [51]:
df1=pd.DataFrame(dict1)
df1
# df1["A","B"]

    A   B   C   D
0  12  13  45  45
1  13  16  34  34
2  45  18  23  23
3  56  14  15  23
4  78  19  17  32

In [41]:
##to see the columns in the df1
df1.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [52]:
df1

    A   B   C   D
0  12  13  45  45
1  13  16  34  34
2  45  18  23  23
3  56  14  15  23
4  78  19  17  32

In [54]:
df1["E"]=df1["A"]+df1["B"]+df1["C"]+df1["D"]

In [55]:
df1

    A   B   C   D    E
0  12  13  45  45  115
1  13  16  34  34   97
2  45  18  23  23  109
3  56  14  15  23  108
4  78  19  17  32  146

In [56]:
df1["F"]=df1["E"]/4

In [57]:
df1

    A   B   C   D    E      F
0  12  13  45  45  115  28.75
1  13  16  34  34   97  24.25
2  45  18  23  23  109  27.25
3  56  14  15  23  108  27.00
4  78  19  17  32  146  36.50